"use client";
import React, { useEffect, useState } from "react";
import Navbar from "../../components/Layouts/Navbar";
import PageBanner from "../../components/Common/PageBanner";
import Footer from "../../components/Layouts/Footer";
import Link from "next/link";
import Image from "next/image";

export default function Page() {
  const [privacy,setPrivacy] = useState({version:'0.0',message:''})
  useEffect(() => {
    fetch(`${process.env.NEXT_PUBLIC_BASEAPI}/policy`, {
      method: "GET",
      headers: {
        Accept: "application/json",
        "Content-Type": "application/json",
      },
    }).then(async (response) => {
      const { data } = await response.json();
      setPrivacy(data);
    });
  }, []);
  return (
    <>
      <Navbar />

      <PageBanner
        pageTitle="นโยบายความเป็นส่วนตัว"
        homePageUrl="/"
        homePageText="หน้าแรก"
        activePageText="นโยบายความเป็นส่วนตัว"
        bgImage="/images/page-title/bg-2.jpg"
      />

      <div className="terms-of-condition-area ptb-100">
        <div className="container">
          <div className="row">
            <div className="col-lg-8 col-md-12">
              <div className="terms-of-condition-content">
                <Image
                  src="/images/privacy-policy.jpg"
                  alt="image"
                  width={700}
                  height={500}
                />

                <h3>นโยบายความเป็นส่วนตัว</h3>
                <div dangerouslySetInnerHTML={{ __html: privacy.message }} />
               
                {/* <p>
                บริษัทของเราตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคลของคุณ เรามุ่งมั่นที่จะรักษาความปลอดภัยและความเป็นส่วนตัวของข้อมูลที่คุณมอบให้กับเรา ดังนั้น เราขอแจ้งให้คุณทราบเกี่ยวกับนโยบายความเป็นส่วนตัวของเราดังนี้
                </p>

                <h5>1. การเก็บรวบรวมข้อมูลส่วนบุคคล</h5>
                <p>
                เราจะเก็บรวบรวมข้อมูลส่วนบุคคลของคุณเมื่อคุณสมัครใช้บริการสินเชื่อของเรา ข้อมูลที่เราเก็บรวบรวมอาจรวมถึงชื่อ ที่อยู่ เบอร์โทรศัพท์ อีเมล และข้อมูลการเงินที่จำเป็นสำหรับการพิจารณาสินเชื่อ
                </p>

                <h5>2. การใช้ข้อมูลส่วนบุคคล</h5>
                <p>
                เราจะใช้ข้อมูลส่วนบุคคลของคุณเพียงเพื่อวัตถุประสงค์ในการให้บริการสินเชื่อและบริการอื่นๆ ที่เกี่ยวข้อง รวมถึงการตรวจสอบและประเมินคำขอสินเชื่อ การติดต่อสื่อสารกับคุณ และการปฏิบัติตามกฎหมายและระเบียบข้อบังคับ
                </p>

                <h5>3. การเปิดเผยข้อมูลส่วนบุคคล</h5>
                <p>
                เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของคุณให้กับบุคคลที่สาม ยกเว้นในกรณีที่ได้รับความยินยอมจากคุณ หรือเป็นไปตามข้อกำหนดของกฎหมาย หรือเพื่อวัตถุประสงค์ในการป้องกันและระงับการทุจริต
                </p>

                <h5>4.  การรักษาความปลอดภัยของข้อมูล</h5>
                <p>
                เราใช้มาตรการรักษาความปลอดภัยที่เหมาะสมเพื่อป้องกันการเข้าถึง การใช้ การเปิดเผย การแก้ไข หรือการทำลายข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต เราจะเก็บข้อมูลของคุณในระบบที่มีการป้องกันและจำกัดการเข้าถึง
                </p>

                <h5>5. การเข้าถึงและแก้ไขข้อมูลส่วนบุคคล</h5>
                <p>
                คุณมีสิทธิ์ในการเข้าถึงและขอแก้ไขข้อมูลส่วนบุคคลของคุณที่เราเก็บรวบรวม หากคุณต้องการเข้าถึงหรือแก้ไขข้อมูลส่วนบุคคลของคุณ กรุณาติดต่อเราผ่านช่องทางที่ระบุไว้ในเว็บไซต์ของเรา
                </p>

                <h5>6. การเก็บรักษาข้อมูล</h5>
                <p>
                เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณตามระยะเวลาที่จำเป็นสำหรับวัตถุประสงค์ในการให้บริการสินเชื่อและการปฏิบัติตามกฎหมายและระเบียบข้อบังคับ เมื่อข้อมูลส่วนบุคคลของคุณไม่มีความจำเป็นสำหรับวัตถุประสงค์ดังกล่าวแล้ว เราจะทำการลบหรือทำให้ข้อมูลดังกล่าวไม่สามารถระบุตัวตนได้
                </p>

                <h5>7. การใช้คุกกี้</h5>
                <p>
                เราอาจใช้คุกกี้เพื่อปรับปรุงประสบการณ์การใช้งานเว็บไซต์ของคุณ คุกกี้เป็นไฟล์ขนาดเล็กที่ถูกเก็บไว้ในอุปกรณ์ของคุณเมื่อคุณเยี่ยมชมเว็บไซต์ คุณสามารถตั้งค่าเบราว์เซอร์ของคุณให้ปฏิเสธคุกกี้ได้ แต่อาจส่งผลกระทบต่อการทำงานของเว็บไซต์บางส่วน
                </p>

                <h5>8. การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว</h5>
                <p>
                เราขอสงวนสิทธิ์ในการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ได้ทุกเวลา หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว เราจะแจ้งให้คุณทราบผ่านทางเว็บไซต์ของเรา
ติดต่อเรา
                </p>

                <p>
                หากคุณมีคำถามหรือข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัวของเรา กรุณาติดต่อเราผ่านทางช่องทางที่ระบุไว้ในเว็บไซต์ของเรา
                </p>

                <p>
                เราขอขอบคุณที่ไว้วางใจและเลือกใช้บริการของเรา
                </p> */}
              </div>
            </div>

            <div className="col-lg-4 col-md-12">
              <div className="terms-of-condition-sidebar">
                <ul>
                  <li>
                    <Link href="/">หน้าแรก</Link>
                  </li>
                  <li>
                    <Link href="/about-us">เกี่ยวกับ</Link>
                  </li>
                  <li>
                    <Link href="/faq">ถามตอบ</Link>
                  </li>
                  {/* <li>
                    <Link href="/loans">สินเชื่อ</Link>
                  </li> */}
                  {/* <li>
                    <Link href="/services">บริการ</Link>
                  </li> */}
                  <li>
                    <Link href="/privacy-policy" className="active">นโยบายความเป็นส่วนตัว</Link>
                  </li>
                  <li >
                    <Link href="/terms-conditions">เงื่อนไขการใช้บริการ</Link>
                  </li>

                  <li>
                    <Link href="/contact">ติดต่อ</Link>
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>

      <Footer />
    </>
  );
}
